-- =======================================
-- Индекс для прецедента 1 (Создание мероприятия)
-- =======================================
-- Описание: Основная операция в этом прецеденте — вставка нового мероприятия.
-- Но индекс нужен, чтобы ускорить операцию чтения данных (в принципе как и все индексы).

CREATE INDEX idx_event_venue_category ON Event(venue_id, category_id);

-- =======================================
-- Индексы для прецедента 2 (Регистрация на мероприятие)
-- =======================================

CREATE INDEX idx_participant_event ON Participant(event_id);
CREATE INDEX idx_app_user_username ON App_User(username);

-- =======================================
-- Индекс для прецедента 3 (Оставление отзыва)
-- =======================================
-- Описание: При оставлении отзыва система должна проверять, зарегистрирован ли пользователь на мероприятие и завершено ли оно.

CREATE INDEX idx_review_event_user ON Review(event_id, user_id);

-- =======================================
-- Индекс для прецедента 4 (Добавление информации о еде)
-- =======================================
-- Описание: Основной запрос — добавление еды и привязка к мероприятию через таблицу Event_Food.

CREATE INDEX idx_event_food_event ON Event_Food(event_id);

-- =======================================
-- Индекс для прецедента 5 (Изменение категории мероприятия)
-- =======================================
-- Описание: Изменение категории — это операция обновления, но выборки мероприятий по категориям могут быть ускорены.

-- Индекс для ускорения выборки по category_id.
CREATE INDEX idx_event_category ON Event(category_id);

-- =======================================
-- Индекс для прецедента 6 (Изменение вместимости мероприятия)
-- =======================================
-- Описание: Система может проверять текущее количество участников и вместимость мероприятия.

-- Индекс для ускорения выборки количества участников на мероприятии.
CREATE INDEX idx_participant_count_event ON Participant(event_id);

-- =======================================
-- Оценка производительности индексов (EXPLAIN ANALYZE)
-- =======================================

EXPLAIN ANALYZE
SELECT COUNT(*) FROM Participant WHERE event_id = 77;

EXPLAIN ANALYZE
SELECT * FROM Event WHERE category_id = 56;

EXPLAIN ANALYZE
SELECT * FROM Review WHERE event_id = 873;
